задачник_едт/src/Documents/ОбращениеВПоддержку/ОбращениеВПоддержку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеВПоддержку</name>
  <registerRecords>AccumulationRegister.ЗадолженостьКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетСИсполнителями</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВидВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбращениеОт</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяКатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийОтделИсполнитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДатуВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеальныйИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоПрограммисту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>прогДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>прогДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.узСпринты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПоказывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавил</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.Категории</types>
      </type>
    </attributes>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>240</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяРешением</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавил</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Статусы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.Статусы</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавил</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчетРабочегоВремени</name>
    <attributes>
      <name>ДатаНачалаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ВложенныйФайл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДетализированыйПланВыполнения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеальныйПланВыполнения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

задачник_едт/src/InformationRegisters/СотрудникиОтделов/СотрудникиОтделов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиОтделов</name>
  <resources>
    <name>ВидМестаРаботы</name>
    <type>
      <types>EnumRef.ВидМестаРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

задачник_едт/src/Documents/ОбращениеВПоддержку/Forms/ФормаВводаНового/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекПольз = ОбщийМодульСервер.ТекущийПользователь();
	СтатусНовая = Справочники.Статусы.Новое;
	Если  Параметры.Ключ.Пустая() Тогда // если не новый док.
		ТекущийОбъект.Автор = ТекПольз.Сотрудник;
		ТекущийОбъект.ТекущийСтатус =СтатусНовая;
		//Добавить статусы
		НоваяСтрока = ТекущийОбъект.Статусы.Добавить();
		НоваяСтрока.Дата = ТекущаяДата();
		НоваяСтрока.Статус = СтатусНовая;
		НоваяСтрока.Добавил = ТекПольз.Сотрудник;
	КонецЕсли;
	
	//Добавить исполнители
	ТекущийОбъект.ТекущийОтделИсполнитель = ТекущийОбъект.ТекущаяКатегория.Отдел;
	// Если у категории не задан основной исполгитель, то назначаем отвевенного по отделу
	Если ЗначениеЗаполнено(ТекущийОбъект.ТекущаяКатегория.Исполнитель) Тогда
		ТекущийОбъект.ТекущийИсполнитель =  ТекущийОбъект.ТекущаяКатегория.Исполнитель;
	//Иначе	
	//	// Ответсвенный по отделу будет являтся основным исполнителем
	//	ТекущийОбъект.ТекущийИсполнитель = ПолучитьОтветственогоПоОтделу(ТекущийОбъект.ТекущийОтделИсполнитель);
	КонецЕсли;
	
	НоваяСтрока = ТекущийОбъект.Исполнители.Добавить();
	НоваяСтрока.Дата = ТекущаяДата();
	НоваяСтрока.Категория = ТекущийОбъект.ТекущаяКатегория;
	НоваяСтрока.Отдел = ТекущийОбъект.ТекущийОтделИсполнитель;
	НоваяСтрока.Исполнитель  = ТекущийОбъект.ТекущийИсполнитель; 
	НоваяСтрока.Добавил = ТекПольз.Сотрудник;
КонецПроцедуры

&НаСервере
 Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	 Если ЗначениеЗаполнено(АдресВрХранилища) Тогда
		 МассивФайлов =  ПолучитьИзВременногоХранилища(АдресВрХранилища);
		 Для Каждого ИмяФайла Из МассивФайлов Цикл
			 ОбщийМодульСервер.ДобавитьПрисоединенныйФайл(ИмяФайла,ТекущийОбъект.Ссылка);
		 КонецЦикла;
	 КонецЕсли;
 КонецПроцедуры

 &НаКлиенте
 Процедура ПриОткрытии(Отказ)
	ТекПольз = ОбщийМодульСервер.ТекущийПользователь();
	ТипОбращений = ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ТипПрименяемыхОбращений");
	Отдел = ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ОтделПоУмолчанию");
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбращениеОт) Тогда 
			Объект.ОбращениеОт = Отдел;
	Иначе
		Если ТипЗнч(Объект.ОбращениеОт) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВидОбращения = ОбщийМодульСервер.ПолучитьВидыОбращений("Внутренние");
		Иначе
			ВидОбращения = ОбщийМодульСервер.ПолучитьВидыОбращений("Внешние");
		КонецЕсли	
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.ТекущаяКатегория) Тогда 
		     Объект.ТекущаяКатегория =  ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"КатегорияПоУмолчанию");
			 
	КонецЕсли;		 
	Если не ЗначениеЗаполнено(Объект.ТекущийОтделИсполнитель) Тогда 
		     Объект.ТекущийОтделИсполнитель =  ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ОтделПоУмолчанию");
			 
	КонецЕсли;		 
	Если НЕ Параметры.Ключ.Пустая() Тогда // если не новый док.
		 Элементы.Файлы.Видимость = Ложь
	 КонецЕсли;	
	 
	Если не ЗначениеЗаполнено(Объект.ТекущийОтделИсполнитель) Тогда 
		     Объект.ТекущийИсполнитель =  ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ИсполнительПоУмолчанию");
			 
	КонецЕсли;		 

КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойОтделСотрудника(ТекПольз)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиОтделов.Отдел,
	|	СотрудникиОтделов.Сотрудник,
	|	СотрудникиОтделов.ВидМестаРаботы
	|ИЗ
	|	РегистрСведений.СотрудникиОтделов КАК СотрудникиОтделов
	|ГДЕ
	|	СотрудникиОтделов.ВидМестаРаботы = &ВидМестаРаботы
	|	И СотрудникиОтделов.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ВидМестаРаботы", Перечисления.ВидМестаРаботы.ОсновноеМесто);
	Запрос.УстановитьПараметр("Сотрудник", ТекПольз.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.ОбращениеОт = Выборка.Отдел;
		ЗаполнитьКонтактыПоОтделу();
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьОтветственогоПоОтделу(ОтделИсполнитель)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиОтделов.Отдел,
	|	СотрудникиОтделов.Сотрудник
	|ИЗ
	|	РегистрСведений.СотрудникиОтделов КАК СотрудникиОтделов
	|ГДЕ
	|	СотрудникиОтделов.Отдел = &Отдел
	|	И СотрудникиОтделов.Ответственный = ИСТИНА";
	
	Запрос.УстановитьПараметр("Отдел", ОтделИсполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе	
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Сотрудник;
		КонецЦикла;	
	КонецЕсли;
	
КонецФункции	

&НаСервере
Процедура ПриИзмененииОбращениеОтНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Объект.КонтактноеЛицо = "";
	Объект.Телефон = "";
	ЗаполнитьКонтактыПоОтделу();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	 

&НаСервере
Процедура ЗаполнитьКонтактыПоОтделу()
	ОтветственныйПоОтделу = ПолучитьОтветственогоПоОтделу(Объект.ОбращениеОт);
	Если ЗначениеЗаполнено(ОтветственныйПоОтделу) Тогда
		Объект.КонтактноеЛицо = ОтветственныйПоОтделу.Наименование;
		ТелОтветст = СокрЛП(ОтветственныйПоОтделу.Телефон);
		Если ЗначениеЗаполнено(Объект.ОбращениеОт.Телефон) Тогда
			Объект.Телефон = СокрЛП(Объект.ОбращениеОт.Телефон)+?(ЗначениеЗаполнено(ТелОтветст),"; "+ТелОтветст,"");
		Иначе
			Объект.Телефон = ТелОтветст;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	 

&НаКлиенте
Процедура ОбращениеОтПриИзменении(Элемент)
	ПриИзмененииОбращениеОтНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединитьФайлы(Команда)
	#Если ВебКлиент Тогда
		ДопПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ПрисоединитьФайлыВВводНового", ЭтаФорма,ДопПараметры);
		
		ОбщийМодульКлиент.ПроверитьПодключениеРасширения(Оповещение);
	#Иначе  
		ПрисоединитьФайлыВыполнить();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединитьФайлыВВводНового(Действия,ДопПараметры) Экспорт
	 ПрисоединитьФайлыВыполнить();
КонецПроцедуры

&НаКлиенте
 Процедура ПрисоединитьФайлыВыполнить()
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//Фильтр = НСтр("ru = 'Текст'; en = 'Text'")
	//    + "(*.txt)|*.txt";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ПрисоединитьФайлыЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
КонецПроцедуры	 

 &НаКлиенте
 Процедура ПрисоединитьФайлыЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
     
     ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
          
     Если (ВыбранныеФайлы <> Неопределено) Тогда
         МассивФайлов = Новый Массив;
         МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
         АдресВрХранилища = ПоместитьВоВременноеХранилище(МассивФайлов);
         Элементы.Файлы.Заголовок =  "Присоединить файлы " + "("+МассивФайлов.Количество()+")" 
     КонецЕсли;

КонецПроцедуры

&НаКлиенте
 Процедура ТекущаяКатегорияПриИзменении(Элемент)
	 // Заполним заголовок обращения из категории если он не заполнен
	 Если НЕ ЗначениеЗаполнено(Объект.Заголовок) Тогда
		  ЗаполнитьЗаголовокОбращенияИзКатегории(); 
	 КонецЕсли;	 
 КонецПроцедуры
 
 &НаСервере
Процедура ЗаполнитьЗаголовокОбращенияИзКатегории()
	 Объект.Заголовок =  Объект.ТекущаяКатегория.Заголовок;
КонецПроцедуры


&НаКлиенте
Процедура ТекущийИсполнительПриИзменении(Элемент)
	Объект.РеальныйИсполнитель = Объект.ТекущийИсполнитель;
КонецПроцедуры
